Autodesk.Revit.DB.ExternalResourceReference.HasValidDisplayPath
Checks whether this external Resource has a valid display path.
Remarks:
For an external resource, such as a Revit link loaded from an external server, the valid display path
should be like "QA Test Data://Nested/Nested_1.rvt".
For an external resource, such as a Revit link loaded from the "built-in" server, the valid display path
should be like "c:\LocalLinks\Link_1.rvt".
Returns:
True if the this external Resource has a valid display path. False otherwise.
Since:
2015

Autodesk.Revit.DB.ExternalResourceReference.GetResourceShortDisplayName
Gets the short display name of the external resource.
Remarks:
For an external resource, such as a Rvt Link loaded from an external server, which has a full display path
such as "QA Test Data://Nested/Nested_1.rvt", this function returns "Nested_1.rvt".
For an external resource, such as a Rvt Link loaded from the "built-in" server, which has a full display path
such as "c:\LocalLinks\Link_1.rvt", this function returns "Link_1.rvt".
Returns:
The short display name of the external resource.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The ExternalResourceReference (this ExternalResourceReference) is has no valid display path.
Since:
2015